l1117/NRF51822_Datelog/main.c
    err_code = ble_conn_params_stop();
    APP_ERROR_CHECK(err_code);
}
/** @snippet [DFU BLE Reset prepare] */
#endif // BLE_DFU_APP_SUPPORT    

static void service_add(void)
{
    uint32_t       err_code;
    ble_bas_init_t bas_init;
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          ble_uuid;
    ble_gatts_attr_md_t attr_md;
    uint8_t             init_len;

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    // Here the sec level for the Battery Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);


    // Add service
    BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_ALERT_NOTIFICATION_SERVICE);

    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid, &m_service_handle);
    APP_ERROR_CHECK(err_code);


    // Add Battery Level characteristic
        memset(&cccd_md, 0, sizeof(cccd_md));

        // According to BAS_SPEC_V10, the read operation on cccd should be possible without
        // authentication.
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
        cccd_md.write_perm = bas_init.battery_level_char_attr_md.cccd_write_perm;
        cccd_md.vloc       = BLE_GATTS_VLOC_STACK;

				memset(&char_md, 0, sizeof(char_md));
		//		char_md.char_props.broadcast = 1;
				char_md.char_props.read   = 1;
		//    char_md.char_props.write   = 1;
				char_md.char_props.notify = 1;
				char_md.p_char_user_desc  = NULL;
				char_md.p_char_pf         = NULL;
				char_md.p_user_desc_md    = NULL;
				char_md.p_cccd_md         = (char_md.char_props.notify) ? &cccd_md : NULL;
				char_md.p_sccd_md         = NULL;
		//		char_md.p_sccd_md = &cccd_md;
		//    char_md.p_sccd_md->vloc       = BLE_GATTS_VLOC_STACK;


				memset(&attr_md, 0, sizeof(attr_md));

				attr_md.read_perm  = bas_init.battery_level_char_attr_md.read_perm;
				attr_md.write_perm = bas_init.battery_level_char_attr_md.write_perm;
				attr_md.vloc       = BLE_GATTS_VLOC_STACK;
				attr_md.rd_auth    = 0;
				attr_md.wr_auth    = 0;
				attr_md.vlen       = 0;

				memset(&attr_char_value, 0, sizeof(attr_char_value));
				attr_char_value.p_attr_md = &attr_md;
				attr_char_value.init_len  = sizeof(uint32_t);
				attr_char_value.init_offs = 0;
				attr_char_value.max_len   = sizeof(uint32_t);
				attr_char_value.p_value   = NULL; //&initial_battery_level;

				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_DATE_TIME_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Vtm_date_time_handles);



		//        uint16_t len=2;
		//        uint8_t  s=1;
		//        err_code = sd_ble_gatts_value_set(p_bas->battery_level_handles.sccd_handle,
		//                                          0,
		//                                          &len,
		//                                          &s);
				char_md.char_props.broadcast = 0;
				char_md.char_props.write   = 0;
				char_md.char_props.notify = 0;
				char_md.p_cccd_md         = (char_md.char_props.notify) ? &cccd_md : NULL;

				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_BATTERY_LEVEL_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.battery_level_handles);

				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_TEMPERATURE_MEASUREMENT_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Vtm_temp_level_handles);

				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_HID_INFORMATION_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Vtm_humi_level_handles);

				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_TEMPERATURE_TYPE_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Nrf_temp_level_handles);


				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_REPORT_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Nrf_name_handles);

				APP_ERROR_CHECK(err_code);




    
#ifdef BLE_DFU_APP_SUPPORT    
    /** @snippet [DFU BLE Service initialization] */
    ble_dfu_init_t   dfus_init;

    // Initialize the Device Firmware Update Service.
    memset(&dfus_init, 0, sizeof(dfus_init));

    dfus_init.evt_handler    = dfu_app_on_dfu_evt;
    dfus_init.error_handler  = NULL; //service_error_handler - Not used as only the switch from app to DFU mode is required and not full dfu service.
    dfus_init.evt_handler    = dfu_app_on_dfu_evt;
    dfus_init.revision       = DFU_REVISION;

    err_code = ble_dfu_init(&m_dfus, &dfus_init);
    APP_ERROR_CHECK(err_code);
    
    dfu_app_reset_prepare_set(reset_prepare);
    /** @snippet [DFU BLE Service initialization] */
#endif // BLE_DFU_APP_SUPPORT    
}


/**@brief Function for handling the Notification timeout.
 *
 * @details This function will be called when the notification timer expires. This will stop the
 *          timer for connection interval and disconnect from the peer.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void notif_timeout_handler(void * p_context)
{
    uint32_t err_code;
    
