l1117/NRF51822_Datelog/main.c
    UNUSED_PARAMETER(p_context);

    // Stop all notifications (by stopping the timer for connection interval that triggers 
    // notifications and disconnecting from peer).
    err_code = app_timer_stop(m_conn_int_timer_id); 
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection interval timeout.
 *
 * @details This function will be called when the connection interval timer expires. This will
 *          trigger another characteristic notification to the peer.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void connection_interval_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    // Into next connection interval. Send one notification.
				char_notify();
}
static void example_cb_handler(pstorage_handle_t  * handle,
															 uint8_t              op_code,
                               uint32_t             result,
                               uint8_t            * p_data,
                               uint32_t             data_len)
{
		if(handle->block_id == pstorage_wait_handle) { pstorage_wait_flag = 0; }  //If we are waiting for this callback, clear the wait flag.
}

static void s5tm_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		uint8_t data_id = 0, data_pos = false;
    uint32_t err_code=0;
		uint8_t timer_flash_id = ((uint8_t)( timer_counter/TIME_PERIOD));
//		uint16_t Vtm_humi=0,Vtm_unknow=0,Vtm_temp=0;
//		int32_t nrf_temp=0;
		uint16_t len = 4;
//		timer_counter+=TIME_PERIOD;
				battery_start(4);	 //For 3.3V boster
//					battery_start(6);  //For 3.7V Li Battery 
	
//				ble_bas_battery_level_update(&m_bas,batt_lvl_in_milli_volts/100);  //For display 3.0V*100 on IOS
				
				nrf_gpio_pin_set (13);												//Open power and UART for 5TM 
				NRF_UART0->POWER = (UART_POWER_POWER_Enabled << UART_POWER_POWER_Pos);
				simple_uart_config(NULL, 10, NULL, 12, false);
				uint8_t cr,rx_count=10;
				Vtm_humi=0,Vtm_unknow=0,Vtm_temp=0;
				for (uint8_t i=0;i<50;i++){										//Get date from 5tm 
//						m_addl_adv_manuf_data[rx_count++]=cr;  //simple_uart_put(cr);

					if (simple_uart_get_with_timeout(4, &cr)) {
							if (cr == 0x20) data_pos = true;    //5TM data start postion.
							if ((cr>>4) == 3 ) { 
								switch (data_id){
									case 1: {
										Vtm_humi = Vtm_humi<<4;
										Vtm_humi |= (cr & 0x0F) ;
										break;
										}
									case 2:  {
										Vtm_unknow = Vtm_unknow<<4;
										Vtm_unknow |= (cr & 0x0F) ;
										break;
										}
									case 3: {
										Vtm_temp = Vtm_temp<<4;
										Vtm_temp |= (cr & 0x0F) ;
										break;
										}
									default: break;
								}
							}
						else if(data_pos) data_id++;
					}
		}	
//				flash_page_data[timer_flash_id] = (Vtm_humi << 16) + Vtm_temp ;
//				flash_page_data[timer_flash_id] = timer_counter ; //test flash write
				NRF_UART0->POWER = (UART_POWER_POWER_Disabled << UART_POWER_POWER_Pos);
				nrf_gpio_pin_clear (13);
				sd_temp_get(&nrf_temp);  													//Get Cpu tempreature
//				int32_t ss ;
//				ss = HTONL(batt_lvl_in_milli_volts);
//        sd_ble_gatts_value_set(m_bas.battery_level_handles.value_handle,0, &len, (uint8_t *)&ss);
//				ss = HTONL(Vtm_temp);
//	      sd_ble_gatts_value_set(m_bas.Vtm_temp_level_handles.value_handle,0, &len, (uint8_t *)&ss);
//				ss = HTONL(Vtm_humi);
//	      sd_ble_gatts_value_set(m_bas.Vtm_humi_level_handles.value_handle,0, &len, (uint8_t *)&ss);
//				ss = HTONL(nrf_temp);
//	      sd_ble_gatts_value_set(m_bas.Nrf_temp_level_handles.value_handle,0, &len, (uint8_t *)&ss);
//				ss = HTONL(timer_counter);
//	      sd_ble_gatts_value_set(m_bas.Vtm_date_time_handles.value_handle,0, &len, (uint8_t *)&ss);
//				ss = (*(uint32_t *)advname);
//	      err_code=sd_ble_gatts_value_set(m_bas.Nrf_name_handles.value_handle,0, &len, (uint8_t *)&ss);

						pstorage_handle_t flash_handle;
						pstorage_block_identifier_get(&flash_base_handle,((((timer_counter/TIME_PERIOD)>>8))%100), &flash_handle);
						if (flash_handle.block_id != flash_handle_last.block_id || flash_handle.module_id != flash_handle_last.module_id) {
								flash_handle_last = flash_handle;
								err_code = pstorage_clear(&flash_handle,1024);
							}
						err_code = pstorage_store(&flash_handle, (uint8_t * ) &timer_counter, 4, timer_flash_id*4);

			 *( (uint32_t *)     m_addl_adv_manuf_data)  = timer_counter ;
			 *( (uint16_t *) (m_addl_adv_manuf_data+4))  = Vtm_temp ;
			 *( (uint16_t *) (m_addl_adv_manuf_data+6))  = Vtm_unknow ;
			 *( (uint16_t *) (m_addl_adv_manuf_data+8))  = Vtm_humi;
			 *( (uint16_t *) (m_addl_adv_manuf_data+10)) = batt_lvl_in_milli_volts ;
			 *( (uint32_t *) (m_addl_adv_manuf_data+12)) = nrf_temp ;


    err_code = ble_advdata_set(&advdata, NULL);
    APP_ERROR_CHECK(err_code);
}

static void timecounter_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		uint32_t err_code;
		if (++timer_counter%TIME_PERIOD){  
				*( (uint32_t *) m_addl_adv_manuf_data) = timer_counter ;
				err_code = ble_advdata_set(&advdata, NULL);
				APP_ERROR_CHECK(err_code);
			}
		else s5tm_timeout_handler(NULL);
}




/**@brief Function for starting application timers.
 *
 * @details This function will be start two timers - one for the time duration for which 
 *          notifications have to be sent to the peer and another for the interval between two 
 *          notifications (which is also the connection interval).
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start connection interval timer.     
//    err_code = app_timer_start(m_conn_int_timer_id,
//                               APP_TIMER_TICKS(APP_CFG_CONNECTION_INTERVAL, APP_TIMER_PRESCALER),
//                               NULL);
//    APP_ERROR_CHECK(err_code);

